Revit 2024 API
BuiltInFailures.MacroFailures.DuplicateModuleName Property
 Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DuplicateModuleName { get; }
Visual Basic
Public Shared ReadOnly Property DuplicateModuleName As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DuplicateModuleName {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MacroFailures Class
Autodesk.Revit.DB Namespace